### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

1. Dataframe : It is used to create  a two dimensional heterogenous object which manipulate its data

In [4]:
df = pd.DataFrame({'name': ['Ram', 'Sachin', 'Rohit', 'Kohli'],
                   'age': [25, 30, 35, 40],
                   'score': [80, 75, 90, 85]})

In [5]:
df

     name  age  score
0     Ram   25     80
1  Sachin   30     75
2   Rohit   35     90
3   Kohli   40     85

2. Series : It is used to create one dimensional homogenous object

In [6]:
df = pd.Series({'name': ['Ram', 'Sachin', 'Rohit', 'Kohli'],
                   'age': [25, 30, 35, 40],
                   'score': [80, 75, 90, 85]})

In [7]:
df

name     [Ram, Sachin, Rohit, Kohli]
age                 [25, 30, 35, 40]
score               [80, 75, 90, 85]
dtype: object

3. fillna() : It is used t fill the missing value with a constant value such as zero

In [8]:
df = pd.DataFrame({'name': ['Ram', None , 'Rohit', 'Kohli'],
                   'age': [25, 30, 35, 40],
                   'score': [80, 75, 90, None]})

In [9]:
df.fillna(0)

    name  age  score
0    Ram   25   80.0
1      0   30   75.0
2  Rohit   35   90.0
3  Kohli   40    0.0

4. describe : We can use describe() function to calculate the stastical of each column

In [10]:
df.describe()

             age      score
count   4.000000   3.000000
mean   32.500000  81.666667
std     6.454972   7.637626
min    25.000000  75.000000
25%    28.750000  77.500000
50%    32.500000  80.000000
75%    36.250000  85.000000
max    40.000000  90.000000

5. info() : Displaying information about the DataFrame , including data types and non null counts

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     4 non-null      int64
 2   score   3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 224.0+ bytes

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [12]:
def reindex_df(df):
    n = len(df)
    new_index = list(range(1, 2*n, 2))
new_index =  df.index

In [13]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

In [14]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [15]:
lst = [10, 20, 30, 40, 50]

df = pd.DataFrame({'Values': lst})

def return_first_3_sum(df):
    result = 0
    for i in range(3):
        result = result + df['Values'].values[i]
    return result

In [16]:
return_first_3_sum(df)

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [24]:
df = pd.DataFrame({'Text': ['Data Science', 'Python Advance', 'Pandas DataFrame', 'Series']})

In [25]:
df['Word_Count'] = df['Text'].apply(len)

In [26]:
df

               Text  Word_Count
0      Data Science          12
1    Python Advance          14
2  Pandas DataFrame          16
3            Series           6

### Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() returns the total nunber of elemente in the DataFrame which is the product of the number of rows and the number of columns for eg , if a DataFrame has 10 rows and 5 columns , then DataFrame.size() will return 50 



DataFrame.shape() returns a tuple of two integer , representing the number of rows and number of columns fo eg , if a DataFrame has 10 rows 5 columns  , then the DataFrame .shape() will return(10,5)

### Q6. Which function of pandas do we use to read an excel file?

We have to use the pd.ecxel_read() function to read excel file using pandas

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [1]:
data = {'Email': ['john@example.com',
                  'robert.johnson@corporation.net',
                  'jane.davis@consultingfirm.com',
                  'david.brown@startup.co',
                  'alice.wang@lawfirm.com',
                  'george.white@nonprofit.org',
                  'emily@example.com',
                  'chris@example.com']}

In [5]:
df = pd.DataFrame(data)

In [6]:
df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])

In [7]:
df

                            Email        Username
0                john@example.com            john
1  robert.johnson@corporation.net  robert.johnson
2   jane.davis@consultingfirm.com      jane.davis
3          david.brown@startup.co     david.brown
4          alice.wang@lawfirm.com      alice.wang
5      george.white@nonprofit.org    george.white
6               emily@example.com           emily
7               chris@example.com           chris

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

  A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: 
  A B C
1 8 2 7
2 6 9 4
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [ ]:
data = {'A' : [3,8,6,2,9],
        'B' : [5,2,9,3,1],
        'C' : [1,7,4,5,2]}

df = pd.DataFrame(data)

In [71]:
def rows(df):
    df = df[(df['A'] > 5) & (df['B'] < 10)]
    return df

In [72]:
rows(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in  the 'Values' column.

In [15]:
import numpy as np
import pandas as pd

def calculate_stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std_dev = df['Values'].std()
    print(f"Mean: {mean}\nMedian: {median}\nStandard Deviation: {std_dev}")

df = pd.DataFrame({'Values': np.random.randint(0,100,10)})

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [13]:
def calculate_moving_average(df):
    result_df = df.copy()
    result_df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return result_df

In [14]:

df = pd.DataFrame({'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100],
                   'Date': pd.date_range('2023-01-01', periods=10, freq='D')})
result_df = calculate_moving_average(df)

In [15]:
result_df

   Sales       Date  MovingAverage
0     10 2023-01-01           10.0
1     20 2023-01-02           15.0
2     30 2023-01-03           20.0
3     40 2023-01-04           25.0
4     50 2023-01-05           30.0
5     60 2023-01-06           35.0
6     70 2023-01-07           40.0
7     80 2023-01-08           50.0
8     90 2023-01-09           60.0
9    100 2023-01-10           70.0

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:

In [28]:
dates = pd.DataFrame({'Date': pd.date_range(start='2023-01-01', freq='D', periods=5)})

def get__weekday(df : pd.DataFrame):
    df['Weekdays'] = df['Date'].dt.day_name()
    return df

In [29]:
get__weekday(df)

   Sales       Date   Weekdays
0     10 2023-01-01     Sunday
1     20 2023-01-02     Monday
2     30 2023-01-03    Tuesday
3     40 2023-01-04  Wednesday
4     50 2023-01-05   Thursday
5     60 2023-01-06     Friday
6     70 2023-01-07   Saturday
7     80 2023-01-08     Sunday
8     90 2023-01-09     Monday
9    100 2023-01-10    Tuesday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [30]:
def select_dates_between(df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    selected_df = df.loc[mask]
    return selected_df

In [31]:
select_dates_between(dates)

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

The first and foremost necessary library that we nesds to be imported is the pandas library . to import the pandas library we need to wrriten the following statement

In [32]:
import pandas as pd

In the above statement we import the pandas library and it is assign it an alias pd. By using the **pd** in prefix we can acess the function  such as pd.read_csv() or pd.DataFrame().